{"pages":[],"posts":[{"title":"My first story: 2022 - a scary year ahead","text":"PrefaceHi, I’m Hung, 18, and this is my first try at writing out the thoughts I (perhaps constantly) have in my head. On this site, I hope to inscribe my journey through this treacherous world onto the ever lasting history of the Internet, and hopefully I won’t get into trouble in the future for writing the stuffs that I wrote 30 years ago. This looks like a good place to insert a disclaimer for all future writings, so here it goes: These stories are just my personal experiences and thoughts, to be read and perhaps emphathized with, and have no intention of harming or offending anyone. Hello World!Today, at least in SGT, is 1 Jan 2022. Bit of a descriptive account to give future readers a slight idea of what it’s like now - COVID is still raging on, and we have a new variant called Omicron that afaik is more infectious that Delta, but seems less fatal. In Singapore, where I am right now, life has been.. unoptimal.. to say the least, for the last 2 years. A lot of political stuffs happened in the last year, with US pulling troops out of Afghanistan and effectively rendering the power to Taliban, Myanmar coup, lots of social unrest in the US, and a lot a lot of political dramas that I can’t possibly remember them all. Meanwhile, Spiderman No Way Home was just released and recently announced to be the biggest blockbuster of 2021 (afaik), but I personally don’t think it’s that good lol. I’m trying to think of things to talk but I can’t really find anything, so I’ll leave the history of the world to the historians out there, and focus on what this is supposed to be about: me. Me, 2021As 2021 ends, my 12 years of formal education have also concluded. Throughout the last year, I’ve found myself loved and cared for by so many groups of people. My family, my friends, teachers, mentors, and just an overall loving community that surrounds and welcomes me every single day. I made too many good memories with robo, with my class friends group, my class, jcrc, boarding school, etc. and etc. Can’t possibly do justice with a list. And for that, I am grateful. I also got into college everybody! Yes, yes I did. Not a flex, but I was accepted into UChicago via ED1. It has relieved a lot of pressure from me for the last 2 weeks of December, and from my parents as well, for we no longer have to await an admission decision to be made a few thousand miles away for the first 3–4 months of 2022. And I am so, so grateful for that too. More on that later.And, I’m moving. Moving out from the boarding school that I’ve called home for the last 4 years, to a rented flat for the next 1 month, and then back to Vietnam before CNY. It definitely felt weird just packing all my stuffs, my entire bane of existence, into a few luggages and boxes. More on that, in some other story that I might not have time nor patience for.I guess to me, if there was a quote to describe my 2021, it would be ‘all good things come to an end.’ End to my journey in my CCAs, my high school, and overall my teenage journey in Singapore. A sweet, sweet one.They’ve come to an end, but perhaps it only means that more good things are going to come into the picture, and make themselves known to all of us. Timeline for 2022My first half of 2022 will be majorly spent with my family in Vietnam. It’s been a really, really long time since I last saw them, and I intend to make the most use out of my time there. I’ll probably learn to drive, intern somewhere, and hopefully travel across Vietnam to see for myself the beauty that my country offers.Come August/September, I will fly to Chicago to embark on a new adventure that is to last for… an extended period of time. And uh.. yeah, that’s the timeline lol. Scary, why?Because I’m leaving my comfort zone to venture into a different environment that I have no idea of what I’ll face. And it’s a vastly different one, not like the jump from Vietnam to Singapore that I took a few years ago. “This is America” - a Childish man once said. It’s going to be a wild, wild world out there, and let’s just pray that I’ll get the hang of it as quickly as I can.It’s not the “omg I’m so scared of getting shot by a stray bullet” kinda scary, but also mentally - the fear of losing the relationships that I have built up over the past few years is perhaps the more damaging one. Losing the physical aspect of any relationship, platonic or non-platonic, is definitely a hard blow. More on this some other time, with perhaps some wise words from my dear philosopher friend DT. Hopes and.. dreams?In general, I hope that I would be able to embrace the challenges that life throws at me and turn them into catalysts for positive changes (ACS Anthem starts playing in the background). I hope that in the next few precious months of rest that I would get, I would achieve the goals that are still somewhat blurry even to myself. I’m definitely learning how to drive, but what else other than that, I’m not even sure myself.From a third-person point of view, my future might look as well set out as it can possibly be for a high school graduate. But to me, it still looks uncertain as hell. But I am going to give it all to make the best out of it.Cheers.","link":"/2022/02/26/My-First-Post/"}],"tags":[{"name":"personal","slug":"personal","link":"/tags/personal/"}],"categories":[]}